// 永久网址:https://libvio.app
慕班。首图2。二级。标题=h1 & &文本；。数据:等式(0)和文本
慕班。首图2。二级。desc=. data . hidden-xs & & Text；；；。数据:eq(1)& Text；。数据:等式(4)和文本
慕班。首图2。二级。内容=。'详细信息-内容和文本'
定义变量 规则={
	标题：利维奥,
	模板：'首图2',
	宿主：' https://www.libvio.me ',
	// host:'https://libvio.app '，
	//hostJs:' print(HOST)；let html=request(HOST，{ headers:{ " User-Agent ":PC _ UA } })；let src=jsp.pdfh(html，" Li:eq(0)& & a:eq(0)& & href ")；打印(src)；HOST=src '，
	//URL:“/type/fy class-fy page . html”，
	全球资源定位器(Uniform Resource Locator)：/show/fyclassfyfilter.html ',
	//URL:“/show _ fyclassfyfilter . html”，
	可滤过的：一,//是否启用分类筛选,
	过滤器_url：-{ { fl . area } }-{ { fl . by } }-{ { fl . lang } }-fy page-{ { fl . year } } ',
	过滤器：{
		"1"：[{"钥匙"："区域","名称"："地区",“价值”：[{" n "："全部"," v "：""},{" n "："中国大陆"," v "："中国大陆"},{" n "："中国香港"," v "："中国香港"},{" n "："中国台湾"," v "："中国台湾"},{" n "："美国"," v "："美国"},{" n "："法国"," v "："法国"},{" n "："英国"," v "："英国"},{" n "："日本"," v "："日本"},{" n "："韩国"," v "："韩国"},{" n "："德国"," v "："德国"},{" n "："泰国"," v "："泰国"},{" n "："印度"," v "："印度"},{" n "："意大利"," v "："意大利"},{" n "："西班牙"," v "："西班牙"},{" n "："加拿大"," v "："加拿大"},{" n "："其他"," v "："其他"}]},{"钥匙"："年份","名称"："年份",“价值”：[{" n "："全部"," v "：""},{" n "："2023"," v "："2023"},{" n "："2022"," v "："2022"},{" n "："2021"," v "："2021"},{" n "："2020"," v "："2020"},{" n "："2019"," v "："2019"},{" n "："2018"," v "："2018"},{" n "："2017"," v "："2017"},{" n "："2016"," v "："2016"},{" n "："2015"," v "："2015"},{" n "："2014"," v "："2014"},{" n "："2013"," v "："2013"},{" n "："2012"," v "："2012"},{" n "："2011"," v "："2011"},{" n "："2010"," v "："2010"}]},{"钥匙"：“郎”,"名称"："语言",“价值”：[{" n "："全部"," v "：""},{" n "："国语"," v "："国语"},{" n "："英语"," v "："英语"},{" n "："粤语"," v "："粤语"},{" n "："闽南语"," v "："闽南语"},{" n "："韩语"," v "："韩语"},{" n "："日语"," v "："日语"},{" n "："法语"," v "："法语"},{" n "："德语"," v "："德语"},{" n "："其它"," v "："其它"}]},{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}],
		"2"：[{"钥匙"："区域","名称"："地区",“价值”：[{" n "："全部"," v "：""},{" n "："中国大陆"," v "："中国大陆"},{" n "："中国台湾"," v "："中国台湾"},{" n "："中国香港"," v "："中国香港"},{" n "："韩国"," v "："韩国"},{" n "："日本"," v "："日本"},{" n "："美国"," v "："美国"},{" n "："泰国"," v "："泰国"},{" n "："英国"," v "："英国"},{" n "："新加坡"," v "："新加坡"},{" n "："其他"," v "："其他"}]},{"钥匙"："年份","名称"："年份",“价值”：[{" n "："全部"," v "：""},{" n "："2023"," v "："2023"},{" n "："2022"," v "："2022"},{" n "："2021"," v "："2021"},{" n "："2020"," v "："2020"},{" n "："2019"," v "："2019"},{" n "："2018"," v "："2018"},{" n "："2017"," v "："2017"},{" n "："2016"," v "："2016"},{" n "："2015"," v "："2015"},{" n "："2014"," v "："2014"},{" n "："2013"," v "："2013"},{" n "："2012"," v "："2012"},{" n "："2011"," v "："2011"},{" n "："2010"," v "："2010"}]},{"钥匙"：“郎”,"名称"："语言",“价值”：[{" n "："全部"," v "：""},{" n "："国语"," v "："国语"},{" n "："英语"," v "："英语"},{" n "："粤语"," v "："粤语"},{" n "："闽南语"," v "："闽南语"},{" n "："韩语"," v "："韩语"},{" n "："日语"," v "："日语"},{" n "："其它"," v "："其它"}]},{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}],
		"4"：[{"钥匙"："区域","名称"："地区",“价值”：[{" n "："全部"," v "：""},{" n "："中国"," v "："中国"},{" n "："日本"," v "："日本"},{" n "："欧美"," v "："欧美"},{" n "："其他"," v "："其他"}]},{"钥匙"："年份","名称"："年份",“价值”：[{" n "："全部"," v "：""},{" n "："2023"," v "："2023"},{" n "："2022"," v "："2022"},{" n "："2021"," v "："2021"},{" n "："2020"," v "："2020"},{" n "："2019"," v "："2019"},{" n "："2018"," v "："2018"},{" n "："2017"," v "："2017"},{" n "："2016"," v "："2016"},{" n "："2015"," v "："2015"},{" n "："2014"," v "："2014"},{" n "："2013"," v "："2013"},{" n "："2012"," v "："2012"},{" n "："2011"," v "："2011"},{" n "："2010"," v "："2010"},{" n "："2009"," v "："2009"},{" n "："2008"," v "："2008"},{" n "："2007"," v "："2007"},{" n "："2006"," v "："2006"},{" n "："2005"," v "："2005"},{" n "："2004"," v "："2004"}]},{"钥匙"：“郎”,"名称"："语言",“价值”：[{" n "："全部"," v "：""},{" n "："国语"," v "："国语"},{" n "："英语"," v "："英语"},{" n "："粤语"," v "："粤语"},{" n "："闽南语"," v "："闽南语"},{" n "："韩语"," v "："韩语"},{" n "："日语"," v "："日语"},{" n "："其它"," v "："其它"}]},{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}],
		"27"：[{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}],
		"15"：[{"钥匙"："区域","名称"："地区",“价值”：[{" n "："全部"," v "：""},{" n "："日本"," v "："日本"},{" n "："韩国"," v "："韩国"}]},{"钥匙"："年份","名称"："年份",“价值”：[{" n "："全部"," v "：""},{" n "："2023"," v "："2023"},{" n "："2022"," v "："2022"},{" n "："2021"," v "："2021"},{" n "："2020"," v "："2020"},{" n "："2019"," v "："2019"},{" n "："2018"," v "："2018"},{" n "："2017"," v "："2017"},{" n "："2016"," v "："2016"},{" n "："2015"," v "："2015"},{" n "："2014"," v "："2014"},{" n "："2013"," v "："2013"},{" n "："2012"," v "："2012"},{" n "："2011"," v "："2011"},{" n "："2010"," v "："2010"}]},{"钥匙"：“郎”,"名称"："语言",“价值”：[{" n "："全部"," v "：""},{" n "："国语"," v "："国语"},{" n "："英语"," v "："英语"},{" n "："粤语"," v "："粤语"},{" n "："闽南语"," v "："闽南语"},{" n "："韩语"," v "："韩语"},{" n "："日语"," v "："日语"},{" n "："其它"," v "："其它"}]},{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}],
		"16"：[{"钥匙"："区域","名称"："地区",“价值”：[{" n "："全部"," v "：""},{" n "："美国"," v "："美国"},{" n "："英国"," v "："英国"},{" n "："德国"," v "："德国"},{" n "："加拿大"," v "："加拿大"},{" n "："其他"," v "："其他"}]},{"钥匙"："年份","名称"："年份",“价值”：[{" n "："全部"," v "：""},{" n "："2023"," v "："2023"},{" n "："2022"," v "："2022"},{" n "："2021"," v "："2021"},{" n "："2020"," v "："2020"},{" n "："2019"," v "："2019"},{" n "："2018"," v "："2018"},{" n "："2017"," v "："2017"},{" n "："2016"," v "："2016"},{" n "："2015"," v "："2015"},{" n "："2014"," v "："2014"},{" n "："2013"," v "："2013"},{" n "："2012"," v "："2012"},{" n "："2011"," v "："2011"},{" n "："2010"," v "："2010"}]},{"钥匙"：“郎”,"名称"："语言",“价值”：[{" n "："全部"," v "：""},{" n "："国语"," v "："国语"},{" n "："英语"," v "："英语"},{" n "："粤语"," v "："粤语"},{" n "："闽南语"," v "："闽南语"},{" n "："韩语"," v "："韩语"},{" n "："日语"," v "："日语"},{" n "："其它"," v "："其它"}]},{"钥匙"："由","名称"："排序",“价值”：[{" n "："时间"," v "：“时间”},{" n "："人气"," v "："点击量"},{" n "："评分"," v "：“分数”}]}]
	},
	头球：{//网站的请求头,完整支持所有的,常带美国联合航空公司和饼干
		//'用户代理':' MOBILE_UA '
		'用户代理'：Mozilla/5.0(Linux；安卓9；华硕_ Z01QD Build/pq3b . 190801.002；wv) AppleWebKit/537.36 (KHTML，像壁虎一样)版本/4.0 Chrome/91 . 0 . 4472 . 114 Safari/537.36 '
	},
	class_parse：。stui-header _ _ menu Li:gt(0):lt(7)；a & & Texta & & href/(\\d+)。' html ',
	// class_parse:“”。stui-header _ _ menu Li；a & & Texta & & href/.*_(\\d+)。' html '，
	tab_exclude：'夸克网盘|百度云盘|迅雷云盘',
	页数：{"27"：一},
	懒惰的：` js:var html = JSON . parse(request(input))。匹配(/r player_。*?=(.*?)% 3C/)[1])；
var url = html.url
var from = html.from
var next = html.link _ next
var id = html.id
var nid = html.nid
//var paurl = request(" https://lib VIO . cc/static/player/"+from+"。js”)。匹配(/ src= "(。*?)'/)[1];
var paurl = request(HOST+"/static/player/"+from+"。js”)。匹配(/ src= "(。*?)'/)[1];
if (/https/)。测试(paurl)) {
var purl = paurl+URL+" & next = "+next+" & id = "+id+" & NID = "+NID；
输入= {
jx: 0，
url:请求(purl)。匹配(/var。* = '(.*?)'/)[1],
分析:0
}
}`,
	searchUrl：/index.php/ajax/suggest？mid=1&wd=**&limit=50 ',
	详细Url：/detail/fyid.html ',//非必填,二级详情拼接链接
	//detail URL:“/detail _ fyid . html”，//非必填,二级详情拼接链接
	//search URL:“/search/* *-fy page-”。' html '，
	搜索：JSON:list；姓名；pic；id ',
}
